lwfinger/rtl8723du/hal/usb_halinit.c
#if (MP_DRIVER == 1)
	if (padapter->registrypriv.mp_mode == 1) {
		padapter->mppriv.channel = pHalData->current_channel;
		MPT_InitializeAdapter(padapter, padapter->mppriv.channel);
	} else
#endif
	{
		pwrctrlpriv->rf_pwrstate = rf_on;

		if (pwrctrlpriv->rf_pwrstate == rf_on) {
			struct pwrctrl_priv *pwrpriv;
			systime start_time;
			u8 restore_iqk_rst;
			u8 b2Ant;
			u8 h2cCmdBuf;

			pwrpriv = adapter_to_pwrctl(padapter);

			/*phy_lc_calibrate_8723d(&pHalData->odmpriv);*/
			halrf_lck_trigger(&pHalData->odmpriv);

			/* Inform WiFi FW that it is the beginning of IQK */
			h2cCmdBuf = 1;
			FillH2CCmd8723D(padapter, H2C_8723D_BT_WLAN_CALIBRATION, 1, &h2cCmdBuf);

			start_time = rtw_get_current_time();
			do {
				if (rtw_read8(padapter, 0x1e7) & 0x01)
					break;

				rtw_msleep_os(50);
			} while (rtw_get_passing_time_ms(start_time) <= 400);

			rtw_btcoex_IQKNotify(padapter, true);
			restore_iqk_rst = (pwrpriv->bips_processing == true) ? true : false;
			b2Ant = pHalData->EEPROMBluetoothAntNum == Ant_x2 ? true : false;
			halrf_iqk_trigger(&pHalData->odmpriv, false);
			/*phy_iq_calibrate_8723d(padapter, false);*/
			pHalData->bIQKInitialized = true;
			rtw_btcoex_IQKNotify(padapter, false);

			/* Inform WiFi FW that it is the finish of IQK */
			h2cCmdBuf = 0;
			FillH2CCmd8723D(padapter, H2C_8723D_BT_WLAN_CALIBRATION, 1, &h2cCmdBuf);

			odm_txpowertracking_check(&pHalData->odmpriv);
		}
	}

	/* Init BT hw config. */
	if (padapter->registrypriv.mp_mode == 1)
		rtw_btcoex_HAL_Initialize(padapter, true);
	else
		rtw_btcoex_HAL_Initialize(padapter, false);

	rtw_hal_set_hwreg(padapter, HW_VAR_NAV_UPPER, (u8 *)&NavUpper);

	/* ack for xmit mgmt frames. */
	rtw_write32(padapter, REG_FWHW_TXQ_CTRL, rtw_read32(padapter, REG_FWHW_TXQ_CTRL) | BIT(12));

	phy_set_bb_reg(padapter, rOFDM0_XAAGCCore1, bMaskByte0, 0x50);
	phy_set_bb_reg(padapter, rOFDM0_XAAGCCore1, bMaskByte0, 0x20);
	/* Enable MACTXEN/MACRXEN block */
	u1bRegCR = rtw_read8(padapter, REG_CR);
	u1bRegCR |= (MACTXEN | MACRXEN);
	rtw_write8(padapter, REG_CR, u1bRegCR);

	if (padapter->registrypriv.wifi_spec == 1)
		phy_set_bb_reg(padapter, rOFDM0_ECCAThreshold,
			       0x00ff00ff, 0x00250029);

exit:

	RTW_INFO("%s in %dms\n", __func__, rtw_get_passing_time_ms(init_start_time));


	return status;
}

static void _DisableGPIO(PADAPTER padapter)
{
	/*
	 * j. GPIO_PIN_CTRL 0x44[31:0]=0x000
	 * k. Value = GPIO_PIN_CTRL[7:0]
	 * l. GPIO_PIN_CTRL 0x44[31:0] = 0x00FF0000 | (value <<8); write external Plevel
	 * m. GPIO_MUXCFG 0x42 [15:0] = 0x0780
	 * n. LEDCFG 0x4C[15:0] = 0x8080
	 */
	u8 value8;
	u16 value16;
	u32 value32;

	/* 1. Disable GPIO[7:0] */
	rtw_write16(padapter, REG_GPIO_PIN_CTRL + 2, 0x0000);
	value32 = rtw_read32(padapter, REG_GPIO_PIN_CTRL) & 0xFFFF00FF;
	value8 = (u8)(value32 & 0x000000FF);
	value32 |= ((value8 << 8) | 0x00FF0000);
	rtw_write32(padapter, REG_GPIO_PIN_CTRL, value32);

	/* 2. Disable GPIO[10:8] */
	rtw_write8(padapter, REG_GPIO_MUXCFG + 3, 0x00);
	value16 = rtw_read16(padapter, REG_GPIO_MUXCFG + 2) & 0xFF0F;
	value8 = (u8)(value16 & 0x000F);
	value16 |= ((value8 << 4) | 0x0780);
	rtw_write16(padapter, REG_GPIO_MUXCFG + 2, value16);

	/* 3. Disable LED0 & 1 */
	rtw_write16(padapter, REG_LEDCFG0, 0x8080);
} /* end of _DisableGPIO() */

static void
_ResetFWDownloadRegister(
	PADAPTER padapter
)
{
	u32 value32;

	value32 = rtw_read32(padapter, REG_MCUFWDL);
	value32 &= ~(MCUFWDL_EN | MCUFWDL_RDY);
	rtw_write32(padapter, REG_MCUFWDL, value32);
}

static void
_ResetBB(
	PADAPTER padapter
)
{
	u16 value16;

	/* reset BB */
	value16 = rtw_read16(padapter, REG_SYS_FUNC_EN);
	value16 &= ~(FEN_BBRSTB | FEN_BB_GLB_RSTn);
	rtw_write16(padapter, REG_SYS_FUNC_EN, value16);
}

static void
_ResetMCU(
	PADAPTER padapter
)
{
	u16 value16;

	/* reset MCU */
	value16 = rtw_read16(padapter, REG_SYS_FUNC_EN);
	value16 &= ~FEN_CPUEN;
	rtw_write16(padapter, REG_SYS_FUNC_EN, value16);
}

static void
_DisableMAC_AFE_PLL(
	PADAPTER padapter
)
{
	u32 value32;

	/* disable MAC/ AFE PLL */
	value32 = rtw_read32(padapter, REG_APS_FSMCO);
	value32 |= APDM_MAC;
	rtw_write32(padapter, REG_APS_FSMCO, value32);

	value32 |= APFM_OFF;
	rtw_write32(padapter, REG_APS_FSMCO, value32);
}

static void
_AutoPowerDownToHostOff(
	PADAPTER padapter
)
{
	u32 value32;

	rtw_write8(padapter, REG_SPS0_CTRL, 0x22);

	value32 = rtw_read32(padapter, REG_APS_FSMCO);

	value32 |= APDM_HOST; /* card disable */
	rtw_write32(padapter, REG_APS_FSMCO, value32);

	/* set USB suspend */
	value32 = rtw_read32(padapter, REG_APS_FSMCO);
	value32 &= ~AFSM_PCIE;
	rtw_write32(padapter, REG_APS_FSMCO, value32);

}

static void
_SetUsbSuspend(
	PADAPTER padapter
)
{
	u32 value32;

	value32 = rtw_read32(padapter, REG_APS_FSMCO);

	/* set USB suspend */
	value32 |= AFSM_HSUS;
	rtw_write32(padapter, REG_APS_FSMCO, value32);

	/* RT_ASSERT(0 == (rtw_read32(padapter, REG_APS_FSMCO) & BIT(12)),("")); */

}

static void
_DisableRFAFEAndResetBB(
	PADAPTER padapter
)
{
	/*
	 * a.	TXPAUSE 0x522[7:0] = 0xFF			Pause MAC TX queue
	 * b.	RF path 0 offset 0x00 = 0x00		disable RF
	 * c.	APSD_CTRL 0x600[7:0] = 0x40
	 * d.	SYS_FUNC_EN 0x02[7:0] = 0x16		reset BB state machine
	 * e.	SYS_FUNC_EN 0x02[7:0] = 0x14		reset BB state machine
	 */
	enum rf_path eRFPath = RF_PATH_A, value8 = 0;

	rtw_write8(padapter, REG_TXPAUSE, 0xFF);
	phy_set_rf_reg(padapter, eRFPath, 0x0, bMaskByte0, 0x0);

	value8 |= APSDOFF;
	rtw_write8(padapter, REG_APSD_CTRL, value8); /*0x40 */

	value8 = 0;
	value8 |= (FEN_USBD | FEN_USBA | FEN_BB_GLB_RSTn);
	rtw_write8(padapter, REG_SYS_FUNC_EN, value8); /*0x16 */

	value8 &= (~FEN_BB_GLB_RSTn);
	rtw_write8(padapter, REG_SYS_FUNC_EN, value8); /*0x14 */

}

static void
_ResetDigitalProcedure1(
	PADAPTER padapter,
	bool bWithoutHWSM
)
{

	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);

	if (pHalData->firmware_version <= 0x20) {
		/*
		 * f.	MCUFWDL 0x80[7:0]=0				reset MCU ready status
		 * g.	SYS_FUNC_EN 0x02[10]= 0			reset MCU register, (8051 reset)
		 * h.	SYS_FUNC_EN 0x02[15-12]= 5		reset MAC register, DCORE
		 * i.     SYS_FUNC_EN 0x02[10]= 1		enable MCU register, (8051 enable)
		 */
		u16 valu16 = 0;

