lwfinger/rtl8723du/hal/usb_halinit.c
	Hal_EfuseParseChnlPlan_8723D(padapter, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseXtal_8723D(padapter, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseThermalMeter_8723D(padapter, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseAntennaDiversity_8723D(padapter, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseCustomerID_8723D(padapter, hwinfo, pHalData->bautoload_fail_flag);

	hal_EfuseParseLEDSetting(padapter, hwinfo, pHalData->bautoload_fail_flag);

	/* set coex. ant info once efuse parsing is done */
	rtw_btcoex_set_ant_info(padapter);

	/* Hal_EfuseParseKFreeData_8723D(padapter, hwinfo, pHalData->bautoload_fail_flag); */
#ifdef CONFIG_RTW_MAC_HIDDEN_RPT
	if (hal_read_mac_hidden_rpt(padapter) != _SUCCESS)
		goto exit;
#endif

	ret = _SUCCESS;

exit:
	return ret;
}

static u8
hal_EfuseParsePROMContent(
	PADAPTER padapter
)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);

	u8 eeValue;
	u32 i;
	u16 value16;
	u8 ret = _FAIL;

	eeValue = rtw_read8(padapter, REG_9346CR);
	/* To check system boot selection. */
	pHalData->EepromOrEfuse = (eeValue & BOOT_FROM_EEPROM) ? true : false;
	pHalData->bautoload_fail_flag = (eeValue & EEPROM_EN) ? false : true;

	RTW_INFO("Boot from %s, Autoload %s !\n", (pHalData->EepromOrEfuse ? "EEPROM" : "EFUSE"),
		 (pHalData->bautoload_fail_flag ? "Fail" : "OK"));

	if (InitpadapterVariablesByPROM_8723du(padapter) != _SUCCESS)
		goto exit;

	ret = _SUCCESS;

exit:
	return ret;
}

static void
_ReadRFType(PADAPTER padapter)
{
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);

#if DISABLE_BB_RF
	pHalData->rf_chip = RF_PSEUDO_11N;
#else
	pHalData->rf_chip = RF_6052;
#endif
}

/*
 * Description:
 *    We should set Efuse cell selection to WiFi cell in default.
 * Assumption:
 *    PASSIVE_LEVEL
 */
static void
hal_EfuseCellSel(PADAPTER padapter)
{
	u32 value32;

	value32 = rtw_read32(padapter, EFUSE_TEST);
	value32 = (value32 & ~EFUSE_SEL_MASK) | EFUSE_SEL(EFUSE_WIFI_SEL_0);
	rtw_write32(padapter, EFUSE_TEST, value32);
}

static u8 rtl8723du_read_adapter_info(PADAPTER padapter)
{
	u8 ret = _FAIL;

	/* Read EEPROM size before call any EEPROM function */
	padapter->EepromAddressSize = GetEEPROMSize8723D(padapter);

	/* Efuse_InitSomeVar(padapter); */

	hal_EfuseCellSel(padapter);

	_ReadRFType(padapter);
	if (hal_EfuseParsePROMContent(padapter) != _SUCCESS)
		goto exit;

	ret = _SUCCESS;

exit:
	return ret;
}

#define GPIO_DEBUG_PORT_NUM 0
static void rtl8723du_trigger_gpio_0(PADAPTER padapter)
{

	u32 gpioctrl;

	RTW_INFO("==> trigger_gpio_0...\n");
	rtw_write16_async(padapter, REG_GPIO_PIN_CTRL, 0);
	rtw_write8_async(padapter, REG_GPIO_PIN_CTRL + 2, 0xFF);
	gpioctrl = (BIT(GPIO_DEBUG_PORT_NUM) << 24) | (BIT(GPIO_DEBUG_PORT_NUM) << 16);
	rtw_write32_async(padapter, REG_GPIO_PIN_CTRL, gpioctrl);
	gpioctrl |= (BIT(GPIO_DEBUG_PORT_NUM) << 8);
	rtw_write32_async(padapter, REG_GPIO_PIN_CTRL, gpioctrl);
	RTW_INFO("<=== trigger_gpio_0...\n");

}

/*
 * If variable not handled here,
 * some variables will be processed in SetHwReg8723A()
 */
static u8 SetHwReg8723du(PADAPTER padapter, u8 variable, u8 *val)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);
	u8 ret = _SUCCESS;

	switch (variable) {
	case HW_VAR_RXDMA_AGG_PG_TH:
		break;
	case HW_VAR_SET_RPWM:
		rtw_write8(padapter, REG_USB_HRPWM, *val);
		break;
	case HW_VAR_TRIGGER_GPIO_0:
		rtl8723du_trigger_gpio_0(padapter);
		break;
	default:
		ret = SetHwReg8723D(padapter, variable, val);
		break;
	}
	return ret;
}

/*
 * If variable not handled here,
 * some variables will be processed in GetHwReg8723A()
 */
static void GetHwReg8723du(PADAPTER padapter, u8 variable, u8 *val)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);


	switch (variable) {
	default:
		GetHwReg8723D(padapter, variable, val);
		break;
	}

}

/*
 * Description:
 * Query setting of specified variable.
 */
static u8
GetHalDefVar8723du(
	PADAPTER padapter,
	HAL_DEF_VARIABLE eVariable,
	void * pValue
)
{
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
	u8 bResult = _SUCCESS;

	switch (eVariable) {
	case HAL_DEF_IS_SUPPORT_ANT_DIV:
		break;
	case HAL_DEF_DRVINFO_SZ:
		*((u32 *)pValue) = DRVINFO_SZ;
		break;
	case HAL_DEF_MAX_RECVBUF_SZ:
		*((u32 *)pValue) = MAX_RECVBUF_SZ;
		break;
	case HAL_DEF_RX_PACKET_OFFSET:
		*((u32 *)pValue) = RXDESC_SIZE + DRVINFO_SZ * 8;
		break;
	case HW_VAR_MAX_RX_AMPDU_FACTOR:
		*((HT_CAP_AMPDU_FACTOR *)pValue) = MAX_AMPDU_FACTOR_64K;
		break;
	default:
		bResult = GetHalDefVar8723D(padapter, eVariable, pValue);
		break;
	}

	return bResult;
}




/*
 * Description:
 * Change default setting of specified variable.
 */
static u8
SetHalDefVar8723du(
	PADAPTER padapter,
	HAL_DEF_VARIABLE eVariable,
	void * pValue
)
{
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
	u8 bResult = _SUCCESS;

	switch (eVariable) {
	default:
		bResult = SetHalDefVar8723D(padapter, eVariable, pValue);
		break;
	}

	return bResult;
}

static void _update_response_rate(PADAPTER padapter, unsigned int mask)
{
	u8 RateIndex = 0;
	/* Set RRSR rate table. */
	rtw_write8(padapter, REG_RRSR, mask & 0xff);
	rtw_write8(padapter, REG_RRSR + 1, (mask >> 8) & 0xff);

	/* Set RTS initial rate */
	while (mask > 0x1) {
		mask = (mask >> 1);
		RateIndex++;
	}
	rtw_write8(padapter, REG_INIRTS_RATE_SEL, RateIndex);
}

static void rtl8723du_init_default_value(PADAPTER padapter)
{
	rtl8723d_init_default_value(padapter);
}

static u8 rtl8723du_ps_func(PADAPTER padapter, HAL_INTF_PS_FUNC efunc_id, u8 *val)
{
	u8 bResult = true;

	switch (efunc_id) {

#if defined(CONFIG_AUTOSUSPEND) && defined(SUPPORT_HW_RFOFF_DETECTED)
	case HAL_USB_SELECT_SUSPEND: {
		u8 bfwpoll = *((u8 *)val);

		rtl8723d_set_FwSelectSuspend_cmd(padapter, bfwpoll, 500); /*note fw to support hw power down ping detect */
	}
	break;
#endif /*CONFIG_AUTOSUSPEND && SUPPORT_HW_RFOFF_DETECTED */

	default:
		break;
	}
	return bResult;
}

void rtl8723du_set_hal_ops(PADAPTER padapter)
{
	struct hal_ops *pHalFunc = &padapter->hal_func;


	rtl8723d_set_hal_ops(pHalFunc);

	pHalFunc->hal_power_on = &_InitPowerOn_8723du;
	pHalFunc->hal_power_off = &CardDisableRTL8723du;

	pHalFunc->hal_init = &rtl8723du_hal_init;
	pHalFunc->hal_deinit = &rtl8723du_hal_deinit;

	pHalFunc->inirp_init = &rtl8723du_inirp_init;
	pHalFunc->inirp_deinit = &rtl8723du_inirp_deinit;

	pHalFunc->init_xmit_priv = &rtl8723du_init_xmit_priv;
	pHalFunc->free_xmit_priv = &rtl8723du_free_xmit_priv;

	pHalFunc->init_recv_priv = &rtl8723du_init_recv_priv;
	pHalFunc->free_recv_priv = &rtl8723du_free_recv_priv;

	pHalFunc->InitSwLeds = &rtl8723du_InitSwLeds;
	pHalFunc->DeInitSwLeds = &rtl8723du_DeInitSwLeds;

	pHalFunc->init_default_value = &rtl8723d_init_default_value;
	pHalFunc->intf_chip_configure = &rtl8723du_interface_configure;
	pHalFunc->read_adapter_info = &rtl8723du_read_adapter_info;

	pHalFunc->set_hw_reg_handler = &SetHwReg8723du;
	pHalFunc->GetHwRegHandler = &GetHwReg8723du;
	pHalFunc->get_hal_def_var_handler = &GetHalDefVar8723du;
	pHalFunc->SetHalDefVarHandler = &SetHalDefVar8723du;

	pHalFunc->hal_xmit = &rtl8723du_hal_xmit;
	pHalFunc->mgnt_xmit = &rtl8723du_mgnt_xmit;
	pHalFunc->hal_xmitframe_enqueue = &rtl8723du_hal_xmitframe_enqueue;

	pHalFunc->interface_ps_func = &rtl8723du_ps_func;
}
